package com.example.anees.utils.how_to_pray_helper

import com.example.anees.R
import com.example.anees.data.model.HowToPrayDto

var eclipsePrayerList = listOf(
    HowToPrayDto(
        title = "صلاة الخسوف / الكسوف",
        description = "صلاة الكسوف سنة مؤكدة، إذا كسفت الشمس أو القمر شرع للمسلمين أن يصلوا صلاة الكسوف، وقد بينها النبي ﷺ بفعله وبقوله -عليه الصلاة والسلام-،\n" +
                "- صلاةُ الكسوفِ والخسوفِ رَكعتانِ، في كلِّ ركعةٍ قِيامانِ، وقِراءتان، ورُكوعانِ، وسَجْدَتانِ، وهذا مذهبُ الجمهور: المالِكيَّة، والشافعيَّة، والحَنابِلَةوهي صلاة جهرية",
        imageResId = R.drawable.p_eclipse
    ),
    HowToPrayDto(
        title = "صفة صلاة الخسوف / الكسوف",
        description = " فالسنة فيها أن تصلى ركعتان بقراءتين وركوعين وسجدتين، هذا هو السنة الذي فعلها النبي ﷺ، فيكبر ويقرأ قراءة طويلة بعد الاستفتاح، ثم يركع ويطيل، ثم يرفع ويقرأ الفاتحة ويقرأ بعدها ما تيسر ويطيل، لكن دون القراءة الأولى، ثم يركع ويطيل لكن دون الركوع الأول، ثم يرفع ويطيل لكن دون الرفع الأول، ثم يسجد سجدتين طويلتين،\n" +
                "\n" +
                " ثم يقوم فيقرأ ويطيل، لكن دون القراءة السابقة، ثم يركع ويطيل لكن دون الركوع السابق، ثم يرفع ويقرأ الفاتحة، وما تيسر معها، ويطيل لكن دون ما قبله، ثم يركع ويطيل لكن دون ما قبله، ثم يرفع بعد الركوع الثاني ويطيل بعض الإطالة مما قبله، ثم يسجد سجدتين طويلتين، ثم يقرأ التشهد التحيات والصلاة على النبي ﷺ والدعاء، ثم يسلم.\n" +
                "\n" +
                "ثم يُذكِّر الناس، ويخطب الناس، ويبين لهم شرعية صلاة الكسوف، ويذكرهم بالله ويأمرهم بالإكثار من التكبير عند رؤية الكسوف، والصدقة، وعتق الرقاب، والصلاة؛ لقوله ﷺ: إذا رأيتم ذلك فصلوا وادعوا، فافزعوا إلى ذكر الله ودعائه واستغفاره فأمر بالتكبير والعتق عند الكسوف -عليه الصلاة والسلام-." +
                "الدليل:\n" +
                "2- عن ابن عبَّاسٍ رَضِيَ اللهُ عنهما، قال: ((انخَسفتِ الشَّمسُ على عهد رسولِ اللهِ صلَّى اللهُ عليه وسلَّم، فصلَّى رسولُ اللهِ صلَّى اللهُ عليه وسلَّم، فقام قيامًا طويلًا، نحوًا من قِراءةِ سورةِ البقرة، ثم ركَع ركوعًا طويلًا، ثم رفَع فقام قيامًا طويلًا، وهو دون القيام الأوَّل، ثم ركَع رُكوعًا طويلًا، وهو دون الركوع الأوَّل، ثم سَجَد، ثم قام قيامًا طويلًا، وهو دون القِيام الأوَّل، ثم ركَع ركوعًا طويلًا، وهو دون الرُّكوعِ الأوَّل، ثمَّ رفَع فقام قيامًا طويلًا، وهو دون القِيامِ الأوَّل، ثم ركَع ركوعًا طويلًا، وهو دون الرُّكوعِ الأوَّل، ثم سجَد، ثم انصرَف وقدْ تجلَّتِ الشَّمسُ  )) ",
        imageResId = R.drawable.p_eid
    ),
)