package com.example.anees.utils.how_to_pray_helper

import com.example.anees.R
import com.example.anees.data.model.HowToPrayDto

///// ممكن حط هنا وا عند خطوات صلاة الالستسقاء ان الصلاتين متشابهتين
var eidPrayerList = listOf(

    HowToPrayDto(
        title = "صلاة العيد",
        description = " صلاة العيد ركعتان، ويدخل وقتها بعد ارتفاع الشمس قدر رمح، وحدده العلماء بزوال حمرتها، وينتهي وقتها بزوال الشمس.\n" +
                ". عن النُّعمانِ بنِ بَشيرٍ رَضِيَ اللهُ عنهما، قال: (كان رسولُ اللهِ صلَّى اللهُ عليه وسلَّم يقرأُ في العِيدينِ، وفي الجُمُعةِ بـسَبِّحِ اسْمَ رَبِّكَ الأَعْلَى، وهَلْ أَتَاكَ حَدِيثُ الغَاشِيَةِ)\n" +
                "تكون بلا أذان ولا إقامة، فعن ابن عباس رضي الله عنهما: " +
                ".(أَنَّ النَّبِيَّ صلى الله عليه وسلم صلى الْعِيدَ بِلا أَذَانٍ، وَلا إِقَامَةٍ) رواه أبو داود، وأصله في صحيح البخاري ",
        imageResId = R.drawable.p_eid
    ),
    HowToPrayDto(
        title = "صفة صلاة العيد",
        description =
        ",يكبر في الركعة الأولى سبعاً من غير تكبيرة الإحرام، ويقرأ في الركعة الأولى بعد الفاتحة بسورة الأعلى أو سورة ق -" +
                "\n " + "وفي الركعة الثانية يكبر خمساً غير تكبيرة الإحرام، ويقرأ بسورة الغاشية أو بسورة القمر " +
                "\n وبعد الصلاة يخطب الإمام خطبة يذكر فيها الناس ويعظهم." +
                "\n ",
        imageResId = R.drawable.p_02
    ),
)