package com.example.anees.utils.how_to_pray_helper

import com.example.anees.R
import com.example.anees.data.model.HowToPrayDto

var fearPrayerList = listOf(
    HowToPrayDto(
        title = "صلاة الخوف",
        description = "الصَّلاةُ المكتوبةُ يَحضُر وقتُها والمسلمونَ في مقاتلةِ العدوِّ، أو في حراسةِ المسلمينَ منهم\n" +
                "إلى آخِر الزَّمان، ولم تُنسَخْ، وهذا باتِّفاق المذاهبِ الفقهيَّة الأربعة: الحَنَفيَّة، والمالِكيَّة، والشافعيَّة، والحَنابِلَة، وبه قال أكثرُ أهلِ العِلم، وحُكِيَ الإجماعُ على ذلك\n" +
                "جميعُ الصِّفاتِ المرويَّة عن النبيِّ صلَّى اللهُ عليه وسلَّم في صلاةِ الخوف  مُعتَدٌّ بها ؛ نصَّ عليه الحَنابِلَةُ  وهو قولُ طائفةٍ من السَّلَف ، واختاره الطبريُّ ، والخطابيُّ  وابنُ حزم ، والنوويُّ  وابنُ تَيميَّة ، وابنُ القيِّم ، والكمالُ ابنُ الهُمام ، والشوكانيُّ  وابنُ باز , وابنُ عثيمين ؛ وذلك جمعًا بين النُّصوصِ الواردةِ في صلاةِ الخوف.\n" ,
        image ="https://github.com/Alikotb/Anees_Images/blob/main/%D8%B5%D9%84%D8%A7%D8%A9%20%D8%A7%D9%84%D8%AE%D9%88%D9%81/p_fear.png?raw=true"
    ),
    HowToPrayDto(
        title = "صفة صفات صلاة الخوف",
        description = "\nأنْ يَجعلَهم الإمامُ فِرقتَينِ: فِرقة بإزاء العدوِّ، وفرقة تُصلِّي معه، فتُصلِّي معه إحدى الفِرقتَينِ ركعةً، ثم تَنصرِف في صلاتها إلى مكانِ الفِرقة الأخرى،" +
                "وتَجيء الأُخرى إلى مكان هذه، فتُصلِّي معه الركعة الثانية، ثم يُسلِّم، وتَقضي كلُّ طائفةٍ ركعةً ركعةً بعد سلام الإمام، وهو مذهب الحَنَفيَّةومذهب الشافعيَّة على الصَّحيح المشهور، وهو مذهب الحَنابِلَة\n" +
                "الادلـة:\n" +
                "أولًا: من الكِتاب\n" +
                "قال الله تعالى:وَإِذَا كُنْتَ فِيهِمْ فَأَقَمْتَ لَهُمُ الصَّلَاةَ فَلْتَقُمْ طَائِفَةٌ مِنْهُمْ مَعَكَ وَلْيَأْخُذُوا أَسْلِحَتَهُمْ فَإِذَا سَجَدُوا فَلْيَكُونُوا مِنْ وَرَائِكُمْ وَلْتَأْتِ طَائِفَةٌ أُخْرَى لَمْ يُصَلُّوا فَلْيُصَلُّوا مَعَكَ وَلْيَأْخُذُوا حِذْرَهُمْ وَأَسْلِحَتَهُمْ وَدَّ الَّذِينَ كَفَرُوا لَوْ تَغْفُلُونَ عَنْ أَسْلِحَتِكُمْ وَأَمْتِعَتِكُمْ فَيَمِيلُونَ عَلَيْكُمْ مَيْلَةً وَاحِدَةً وَلَا جُنَاحَ عَلَيْكُمْ إِنْ كَانَ بِكُمْ أَذًى مِنْ مَطَرٍ أَوْ كُنْتُمْ مَرْضَى أَنْ تَضَعُوا أَسْلِحَتَكُمْ وَخُذُوا حِذْرَكُمْ إِنَّ اللَّهَ أَعَدَّ لِلْكَافِرِينَ عَذَابًا مُهِينًا\n" +
                "\n[النساء:102]" +
                "ثانيًا: من السُّنَّة\n" +
                " عن ابنِ عُمر رَضِيَ اللهُ عنهما قال:صَلَّى رسولُ صلاةَ الخوفِ بإحدى الطائفتينِ ركعةً، والطائفةُ الأخرى مواجهةُ العدوِّ، ثم انصرفوا وقاموا في مقامِ أصحابِهم، مُقبِلينَ على العدوِّ، وجاء أولئك، ثم صَلَّى بهم النبيُّ صلَّى اللهُ عليه وسلَّم ركعةً، ثم سَلَّمَ النبيُّ صلَّى اللهُ عليه وسلَّم، ثم قضَى هؤلاءِ ركعةً، وهؤلاءِ ركعةً\n" ,
        image = "https://github.com/Alikotb/Anees_Images/blob/main/%D8%A7%D9%84%D8%B5%D9%84%D8%A7%D8%A9/p_01.png?raw=true"
    ),
)